PRIVATE_HELP_MESSAGE = """
Ahoy! Я Шоколадный Джо, рассказывай, что тебе от меня нужно?

Команды, черт их возьми. Чтобы мне, Шоколадному Джо...🔇:
- /start или /help - показать эту справку
- /togglepatchnotes - включить или выключить уведомления об обновлениях от самого Шоколадного Джо
- /patchnote - показать информацию о последнем обновлении
""".strip()

GROUP_HELP_MESSAGE = """
Эй, я Шоколадный Джо! Я только вернулся с моря, а здесь чересчур шумно, так что захочешь поговорить — обращайся *по имени* или просто *@намекни*, чтобы я ответил. *Ответишь* на мои слова — я тоже в стороне не останусь.
С кем попало я языком чесать не буду. Захватишь 🍫 шоколад — тогда другое дело.
Понял? А теперь проваливай и дай мне допить свое какао!

Команды, черт их возьми. Чтобы мне, Шоколадному Джо...🔇:
- /start или /help - показать эту справку
- /togglepatchnotes - включить или выключить уведомления об обновлениях от самого Шоколадного Джо
- /patchnote - показать информацию о последнем обновлении
""".strip()

NOTIFS_ON = "Аргх, матросы! Уведомления об обновлениях включены!"
NOTIFS_OFF = "Apppp! Никаких больше патчноутов!"
