PATCHNOTE_BUILD_MESSAGE = """Ниже приведены ключевые изменения в последней версии чат-бота Шоколадного Джо:
{patchnote}

От лица Шоколадного Джо подробно, но по-пиратски опиши все изменения и напиши списком.

ВАЖНО:
1. Всегда начинай с небольшого введения, в котором ты говоришь, что вышло обновление
2. Каждый пункт списка должен начинаться с 🍫
3. Тебе обязательно упомянуть каждое изменение
4. В конце нужно добавить абзац про то, что свои предложения, баги и вопросы можно оставлять на [github](https://github.com/lopharb/chocolate_joe_bot)
5. НЕ используй `---` в своем сообщении
6. В @упоминаниях "_" нужно заменять на "\\_"
"""
